തൊഴില്‍ നഷ്ടപ്പെട്ടവര്‍, രോഗബാധിതര്‍, സന്ദര്‍ശന വിസയിലെത്തി കുടുങ്ങിയവര്‍, ഗര്‍ഭിണികള്‍, പ്രായമായവര്‍, ആശ്രിതരുടെ മരണത്തെ തുടര്‍ന്ന് നാട്ടിലേക്ക് മടങ്ങുന്നവര്‍ തുടങ്ങിയവരായിരുന്നു യാത്രക്കാര്‍.
പുനരുല്‍പ്പാദന ഈര്‍ജ്ജ മേഖലകളില്‍ ഗവണ്‍മെന്റ് മത്സരാധിഷ്ഠിത ലേലം കൊണ്ടുവരിക വഴി ഉപഭോക്താക്കള്‍ക്ക് താങ്ങാവുന്ന നിരക്ക് ഉറപ്പു വരുത്തി.
മുഖ്യമന്ത്രി എന്ന പദവിയില്‍ തന്നെ കെട്ടിയിടാന്‍ താന്‍ ആഗ്രഹിക്കുന്നില്ലെന്നും.
‘‘ഇതെപ്പിടിയാവുമോ എന്തോ?
വിദേശകാര്യ സഹമന്ത്രി വി മുരളീധരന്‍ ലോക്‌സഭയില്‍ വ്യക്തമാക്കിയതാണ് ഇക്കാര്യങ്ങൾ.
